{"class_name": "Functional", "config": {"name": "MobilenetV3small", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1600, 256, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling", "trainable": true, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "name": "rescaling", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv", "inbound_nodes": [[["rescaling", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv/BatchNorm", "inbound_nodes": [[["Conv", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2", "op": "AddV2", "input": ["Conv/BatchNorm/cond/Identity", "AddV2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2", "inbound_nodes": [[["Conv/BatchNorm", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu", "inbound_nodes": [[["tf_op_layer_AddV2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul", "op": "Mul", "input": ["re_lu/Relu6", "Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "name": "multiply", "inbound_nodes": [[["tf_op_layer_Mul", 0, 0, {}], ["Conv/BatchNorm", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv/depthwise/pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv/depthwise/pad", "inbound_nodes": [[["multiply", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv/depthwise", "inbound_nodes": [[["expanded_conv/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_1", "inbound_nodes": [[["expanded_conv/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv/squeeze_excite/AvgPool", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 16]}, "name": "reshape", "inbound_nodes": [[["expanded_conv/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/squeeze_excite/Conv", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_1", "op": "AddV2", "input": ["expanded_conv/squeeze_excite/Conv_1/BiasAdd", "AddV2_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_1", "inbound_nodes": [[["expanded_conv/squeeze_excite/Conv_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_2", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_1", "op": "Mul", "input": ["re_lu_2/Relu6", "Mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_1", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv/squeeze_excite/Mul", "inbound_nodes": [[["re_lu_1", 0, 0, {}], ["tf_op_layer_Mul_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/project", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/project", "inbound_nodes": [[["expanded_conv/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv/project/BatchNorm", "inbound_nodes": [[["expanded_conv/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1/expand", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1/expand", "inbound_nodes": [[["expanded_conv/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_1/expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3", "inbound_nodes": [[["expanded_conv_1/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_1/depthwise/pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv_1/depthwise/pad", "inbound_nodes": [[["re_lu_3", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_1/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_1/depthwise", "inbound_nodes": [[["expanded_conv_1/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_1/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_4", "inbound_nodes": [[["expanded_conv_1/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1/project", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1/project", "inbound_nodes": [[["re_lu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/project/BatchNorm", "inbound_nodes": [[["expanded_conv_1/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2/expand", "trainable": true, "dtype": "float32", "filters": 88, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2/expand", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_2/expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_5", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_5", "inbound_nodes": [[["expanded_conv_2/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_2/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_2/depthwise", "inbound_nodes": [[["re_lu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_2/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_6", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_6", "inbound_nodes": [[["expanded_conv_2/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2/project", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2/project", "inbound_nodes": [[["re_lu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/project/BatchNorm", "inbound_nodes": [[["expanded_conv_2/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_2/Add", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_2/Add", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}], ["expanded_conv_2/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/expand", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/expand", "inbound_nodes": [[["expanded_conv_2/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_3/expand", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_2", "op": "AddV2", "input": ["expanded_conv_3/expand/BatchNorm/cond/Identity", "AddV2_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_2", "inbound_nodes": [[["expanded_conv_3/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_7", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_7", "inbound_nodes": [[["tf_op_layer_AddV2_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_2", "op": "Mul", "input": ["re_lu_7/Relu6", "Mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_2", "inbound_nodes": [[["re_lu_7", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "name": "multiply_1", "inbound_nodes": [[["tf_op_layer_Mul_2", 0, 0, {}], ["expanded_conv_3/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_3/depthwise/pad", "trainable": true, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "expanded_conv_3/depthwise/pad", "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_3/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_3/depthwise", "inbound_nodes": [[["expanded_conv_3/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_3/depthwise", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_3", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_3", "op": "AddV2", "input": ["expanded_conv_3/depthwise/BatchNorm/cond/Identity", "AddV2_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_3", "inbound_nodes": [[["expanded_conv_3/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_8", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_8", "inbound_nodes": [[["tf_op_layer_AddV2_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_3", "op": "Mul", "input": ["re_lu_8/Relu6", "Mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_3", "inbound_nodes": [[["re_lu_8", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true, "dtype": "float32"}, "name": "multiply_2", "inbound_nodes": [[["tf_op_layer_Mul_3", 0, 0, {}], ["expanded_conv_3/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_3/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv_3/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 96]}, "name": "reshape_1", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/squeeze_excite/Conv", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_3/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_3/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_4", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_4", "op": "AddV2", "input": ["expanded_conv_3/squeeze_excite/Conv_1/BiasAdd", "AddV2_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_4", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Conv_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_9", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_9", "inbound_nodes": [[["tf_op_layer_AddV2_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_4", "op": "Mul", "input": ["re_lu_9/Relu6", "Mul_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_4", "inbound_nodes": [[["re_lu_9", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_3/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_3/squeeze_excite/Mul", "inbound_nodes": [[["multiply_2", 0, 0, {}], ["tf_op_layer_Mul_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/project", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/project", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/project/BatchNorm", "inbound_nodes": [[["expanded_conv_3/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/expand", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_4/expand", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_5", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_5", "op": "AddV2", "input": ["expanded_conv_4/expand/BatchNorm/cond/Identity", "AddV2_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_5", "inbound_nodes": [[["expanded_conv_4/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_10", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_10", "inbound_nodes": [[["tf_op_layer_AddV2_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_5", "op": "Mul", "input": ["re_lu_10/Relu6", "Mul_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_5", "inbound_nodes": [[["re_lu_10", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true, "dtype": "float32"}, "name": "multiply_3", "inbound_nodes": [[["tf_op_layer_Mul_5", 0, 0, {}], ["expanded_conv_4/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_4/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_4/depthwise", "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_4/depthwise", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_6", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_6", "op": "AddV2", "input": ["expanded_conv_4/depthwise/BatchNorm/cond/Identity", "AddV2_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_6", "inbound_nodes": [[["expanded_conv_4/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_11", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_11", "inbound_nodes": [[["tf_op_layer_AddV2_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_6", "op": "Mul", "input": ["re_lu_11/Relu6", "Mul_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_6", "inbound_nodes": [[["re_lu_11", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true, "dtype": "float32"}, "name": "multiply_4", "inbound_nodes": [[["tf_op_layer_Mul_6", 0, 0, {}], ["expanded_conv_4/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_4/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv_4/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_4", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "reshape_2", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/squeeze_excite/Conv", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_4/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_4/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_7", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_7", "op": "AddV2", "input": ["expanded_conv_4/squeeze_excite/Conv_1/BiasAdd", "AddV2_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_7", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Conv_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_12", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_12", "inbound_nodes": [[["tf_op_layer_AddV2_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_7", "op": "Mul", "input": ["re_lu_12/Relu6", "Mul_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_7", "inbound_nodes": [[["re_lu_12", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_4/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_4/squeeze_excite/Mul", "inbound_nodes": [[["multiply_4", 0, 0, {}], ["tf_op_layer_Mul_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/project", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/project", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/project/BatchNorm", "inbound_nodes": [[["expanded_conv_4/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_4/Add", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_4/Add", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}], ["expanded_conv_4/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/expand", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/expand", "inbound_nodes": [[["expanded_conv_4/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_5/expand", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_8", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_8", "op": "AddV2", "input": ["expanded_conv_5/expand/BatchNorm/cond/Identity", "AddV2_8/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_8", "inbound_nodes": [[["expanded_conv_5/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_13", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_13", "inbound_nodes": [[["tf_op_layer_AddV2_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_8", "op": "Mul", "input": ["re_lu_13/Relu6", "Mul_8/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_8", "inbound_nodes": [[["re_lu_13", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_5", "trainable": true, "dtype": "float32"}, "name": "multiply_5", "inbound_nodes": [[["tf_op_layer_Mul_8", 0, 0, {}], ["expanded_conv_5/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_5/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_5/depthwise", "inbound_nodes": [[["multiply_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_5/depthwise", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_9", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_9", "op": "AddV2", "input": ["expanded_conv_5/depthwise/BatchNorm/cond/Identity", "AddV2_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_9", "inbound_nodes": [[["expanded_conv_5/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_14", "inbound_nodes": [[["tf_op_layer_AddV2_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_9", "op": "Mul", "input": ["re_lu_14/Relu6", "Mul_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_9", "inbound_nodes": [[["re_lu_14", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true, "dtype": "float32"}, "name": "multiply_6", "inbound_nodes": [[["tf_op_layer_Mul_9", 0, 0, {}], ["expanded_conv_5/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_5/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv_5/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 240]}, "name": "reshape_3", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/squeeze_excite/Conv", "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_5/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_5/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_10", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_10", "op": "AddV2", "input": ["expanded_conv_5/squeeze_excite/Conv_1/BiasAdd", "AddV2_10/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3.0}}, "name": "tf_op_layer_AddV2_10", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Conv_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_15", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_15", "inbound_nodes": [[["tf_op_layer_AddV2_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_10", "op": "Mul", "input": ["re_lu_15/Relu6", "Mul_10/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.1666666716337204}}, "name": "tf_op_layer_Mul_10", "inbound_nodes": [[["re_lu_15", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_5/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_5/squeeze_excite/Mul", "inbound_nodes": [[["multiply_6", 0, 0, {}], ["tf_op_layer_Mul_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/project", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/project", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/project/BatchNorm", "inbound_nodes": [[["expanded_conv_5/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_5/Add", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_5/Add", "inbound_nodes": [[["expanded_conv_4/Add", 0, 0, {}], ["expanded_conv_5/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_6/expand", "trainable": true, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, 